RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_gpio.c
      case AFIO_MAP5:
        AFIO_MAPx = &(AFIO->MAP5);
        break;

      case AFIO_MAP6:
        AFIO_MAPx = &(AFIO->MAP6);
        break;

      case AFIO_MAP7:
        AFIO_MAPx = &(AFIO->MAP7);
        break;

#ifndef AT32F413xx
      case AFIO_MAP8:
        AFIO_MAPx = &(AFIO->MAP8);
        break;
#endif

      default:
        break;
    }

    if(bit_ost == BITS0)
    {
#ifdef AT32F415xx
      if(reg_ost == AFIO_MAP8)
      {
        *AFIO_MAPx &= 0xFFFFFFFC;
      }else
      {
        *AFIO_MAPx &= OFFSET_MASK0;
      }
#else
      *AFIO_MAPx &= OFFSET_MASK0;
#endif
    }
    else if(bit_ost == BITS1)
    {
      #ifdef AT32F415xx
      if(reg_ost == AFIO_MAP8)
      {
        *AFIO_MAPx &= 0xFFFFFFF3;
      }else
      {
        *AFIO_MAPx &= OFFSET_MASK1;
      }
      #elif defined (AT32F403Axx) || defined (AT32F407xx)
      if(reg_ost == AFIO_MAP4)
      {
        if(Remap_Addr > 4)
        {
          *AFIO_MAPx &= 0xFFFFFF3F;
        }else
        {
          *AFIO_MAPx &= 0xFFFFFFCF;
        }
      }else
      {
        *AFIO_MAPx &= OFFSET_MASK1;
      }
      #else
      *AFIO_MAPx &= OFFSET_MASK1;
      #endif
    }
    else if(bit_ost == BITS2)
    {
#ifdef AT32F415xx
      if(reg_ost == AFIO_MAP8)
      {
        *AFIO_MAPx &= 0xFFFFFFCF;
      }else
      {
        *AFIO_MAPx &= OFFSET_MASK2;
      }
#else
      *AFIO_MAPx &= OFFSET_MASK2;
#endif
    }
    else if(bit_ost == BITS3)
    {
#ifdef AT32F415xx
      if(reg_ost == AFIO_MAP8)
      {
        *AFIO_MAPx &= 0xFFFFFF3F;
      }else
      {
        *AFIO_MAPx &= OFFSET_MASK3;
      }
#else
      *AFIO_MAPx &= OFFSET_MASK3;
#endif
    }
    else if(bit_ost == BITS4)
    {
      *AFIO_MAPx &= OFFSET_MASK4;
    }
    else if(bit_ost == BITS5)
    {
      *AFIO_MAPx &= OFFSET_MASK5;
    }
    else if(bit_ost == BITS6)
    {
      *AFIO_MAPx &= OFFSET_MASK6;
    }
    else if(bit_ost == BITS7)
    {
      *AFIO_MAPx &= OFFSET_MASK7;
    }

    if(NewState == ENABLE)
    {
      *AFIO_MAPx |= Remap_val;
    }

  }
  else
#endif
  {
    /* Check the parameters */
    assert_param(IS_GPIO_REMAP(GPIO_Remap));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    switch(GPIO_Remap)
    {
    case GPIO_Remap_I2C1:
    case GPIO_Remap_USART1:
    case GPIO_Remap_PD01:
    case GPIO_Remap_TMR5CH4_LSI:
    case GPIO_Remap_ADC1_EXTRGINJ:
    case GPIO_Remap_ADC1_EXTRGREG:
#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)
    case GPIO_Remap_USART2:
    case GPIO_Remap_TMR4:
#endif
#ifndef AT32F415xx
    case GPIO_Remap_ADC2_EXTRGINJ:
    case GPIO_Remap_ADC2_EXTRGREG:
#endif
      AFIO->MAP &= ~GPIO_Remap;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap;
      }

      break;

    case GPIO_Remap01_SPI1:
      AFIO->MAP &= 0x7FFFFFFE;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap01_SPI1;
      }

      break;

#ifdef AT32F403xx
    case GPIO_Remap10_SPI1:
      AFIO->MAP &= 0x7FFFFFFE;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap10_SPI1;
      }

      break;
#endif

    case GPIO_PartialRemap_USART3:
      AFIO->MAP &= 0xFFFFFFCF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap_USART3;
      }

      break;

#ifdef AT32F415xx
    case GPIO_PartialRemap2_USART3:
      AFIO->MAP &= 0xFFFFFFCF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap2_USART3;
      }

      break;

    case GPIO_PartialRemap2_TMR1:
      AFIO->MAP &= 0xFFFFFF3F;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap2_TMR1;
      }

      break;
#endif

#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)
    case GPIO_FullRemap_USART3:
      AFIO->MAP &= 0xFFFFFFCF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_FullRemap_USART3;
      }

      break;
#endif

    case GPIO_PartialRemap_TMR1:
      AFIO->MAP &= 0xFFFFFF3F;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap_TMR1;
      }

      break;

#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)
    case GPIO_FullRemap_TMR1:
      AFIO->MAP &= 0xFFFFFF3F;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_FullRemap_TMR1;
      }

      break;
#endif

    case GPIO_PartialRemap1_TMR2:
      AFIO->MAP &= 0xFFFFFCFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap1_TMR2;
      }

      break;

    case GPIO_PartialRemap2_TMR2:
      AFIO->MAP &= 0xFFFFFCFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap2_TMR2;
      }

      break;

    case GPIO_FullRemap_TMR2:
      AFIO->MAP &= 0xFFFFFCFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_FullRemap_TMR2;
      }

      break;

    case GPIO_PartialRemap_TMR3:
      AFIO->MAP &= 0xFFFFF3FF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_PartialRemap_TMR3;
      }

      break;

    case GPIO_FullRemap_TMR3:
      AFIO->MAP &= 0xFFFFF3FF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_FullRemap_TMR3;
      }

      break;

    case GPIO_Remap1_CAN1:
      AFIO->MAP &= 0xFFFF9FFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap1_CAN1;
      }

      break;

#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)
    case GPIO_Remap2_CAN1:
      AFIO->MAP &= 0xFFFF9FFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap2_CAN1;
      }

      break;
#endif

    case GPIO_Remap_SWJ_NoJNTRST:
      AFIO->MAP &= 0xF8FFFFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_SWJ_NoJNTRST;
      }

      break;

    case GPIO_Remap_SWJ_JTAGDisable:
      AFIO->MAP &= 0xF8FFFFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_SWJ_JTAGDisable;
      }

      break;

    case GPIO_Remap_SWJ_AllDisable:
      AFIO->MAP &= 0xF8FFFFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_SWJ_AllDisable;
      }

      break;

#if defined (AT32F403Axx) || defined (AT32F407xx)
    case GPIO_Remap_PTP_PPS:
      AFIO->MAP &= ~GPIO_Remap_PTP_PPS;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_PTP_PPS;
      }

      break;

    case GPIO_Remap_TMR2ITR1:
      AFIO->MAP &= ~GPIO_Remap_TMR2ITR1;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_TMR2ITR1;
      }

      break;

    case GPIO_Remap_SPI3:
      AFIO->MAP &= ~GPIO_Remap_SPI3;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_SPI3;
      }

      break;

    case GPIO_Remap_MII_RMII:
      AFIO->MAP &= ~GPIO_Remap_MII_RMII;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_MII_RMII;
      }

      break;

    case GPIO_Remap_CAN2:
      AFIO->MAP &= ~GPIO_Remap_CAN2;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_CAN2;
      }

      break;

    case GPIO_Remap_ETH:
      AFIO->MAP &= ~GPIO_Remap_ETH;

      if(NewState == ENABLE)
      {
        AFIO->MAP |= GPIO_Remap_ETH;
      }

      break;
#endif

