RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_gpio.c
#if defined (AT32F403xx)
    case GPIO_Remap_TMR15:
    case GPIO_Remap_TMR10:
    case GPIO_Remap_TMR11:
    case GPIO_Remap_TMR13:
    case GPIO_Remap_TMR14:
      AFIO->MAP2 &= ~(GPIO_Remap & 0x003FFFFF);

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap & 0x003FFFFF);
      }

      break;
#endif

#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)
    case GPIO_Remap_TMR9:
    case GPIO_Remap_XMC_NADV:
    case GPIO_Remap_SPI4:
    case GPIO_Remap_I2C3:
    case GPIO_Remap_EXT_FLASH:
      AFIO->MAP2 &= ~(GPIO_Remap & 0x003FFFFF);

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap & 0x003FFFFF);
      }

      break;

    case GPIO_Remap01_SDIO2:
      AFIO->MAP2 &= 0xFFE7FFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap01_SDIO2 & 0x003FFFFF);
      }

      break;

    case GPIO_Remap10_SDIO2:
      AFIO->MAP2 &= 0xFFE7FFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap10_SDIO2 & 0x003FFFFF);
      }

      break;

    case GPIO_Remap11_SDIO2:
      AFIO->MAP2 &= 0xFFE7FFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap11_SDIO2 & 0x003FFFFF);
      }

      break;
#elif defined (AT32F413xx)
    case GPIO_Remap_EXT_FLASH:
      AFIO->MAP2 &= ~(GPIO_Remap & 0x003FFFFF);

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap & 0x003FFFFF);
      }

      break;
#elif defined (AT32F415xx)
    case GPIO_Remap01_COMP:
      AFIO->MAP2 &= 0xF3FFFFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap01_COMP & 0xBFFFFFFF);
      }

      break;

    case GPIO_Remap10_COMP:
      AFIO->MAP2 &= 0xF3FFFFFF;

      if(NewState == ENABLE)
      {
        AFIO->MAP2 |= (GPIO_Remap10_COMP & 0xBFFFFFFF);
      }

      break;
#endif

    default:
      break;
    }
  }
}

/**
  * @brief  Selects the GPIO pin used as EXTI Line.
  * @param  GPIO_PortSource: selects the GPIO port to be used as source for EXTI lines.
  *   This parameter can be GPIO_PortSourceGPIOx where x can be (A..G).
  * @param  GPIO_PinSource: specifies the EXTI line to be configured.
  *   This parameter can be GPIO_PinSourcex where x can be (0..15).
  * @retval None
  */
void GPIO_EXTILineConfig(uint8_t GPIO_PortSource, uint8_t GPIO_PinSource)
{
  uint32_t tmp = 0x00;
  /* Check the parameters */
  assert_param(IS_GPIO_EXTI_PORT_SOURCE(GPIO_PortSource));
  assert_param(IS_GPIO_PINS_SOURCE(GPIO_PinSource));

  tmp = ((uint32_t)0x0F) << (0x04 * (GPIO_PinSource & (uint8_t)0x03));
  AFIO->EXTIC[GPIO_PinSource >> 0x02] &= ~tmp;
  AFIO->EXTIC[GPIO_PinSource >> 0x02] |= (((uint32_t)GPIO_PortSource) << (0x04 * (GPIO_PinSource & (uint8_t)0x03)));
}

/**
  * @brief  Selects the Ethernet media interface.
  * @note   This function applies only to AT32 Connectivity line devices.
  * @param  GPIO_ETH_MediaInterface: specifies the Media Interface mode.
  *   This parameter can be one of the following values:
  *     @arg GPIO_ETH_MediaInterface_MII: MII mode
  *     @arg GPIO_ETH_MediaInterface_RMII: RMII mode
  * @retval None
  */
void GPIO_ETH_MediaInterfaceConfig(uint32_t GPIO_ETH_MediaInterface)
{
  assert_param(IS_GPIO_ETH_MEDIA_INTERFACE(GPIO_ETH_MediaInterface));
  /* Configure MII_RMII selection bit */
  *(__IO uint32_t *) MAPR_MII_RMII_SEL_BB = GPIO_ETH_MediaInterface;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


